dong4j/desk-gateway/firmware/desk-gateway/sdkconfig.defaults
# YD-ESP32-S3 N16R8：16MB Flash + Octal 8MB PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# YD-ESP32-S3 用板载 USB-C（USB Serial/JTAG）做控制台，才能在监视器里输入 wifi 等命令
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 本地语音使用独立 4 MiB SPIFFS；Factory App 扩到 3 MiB，避免继续挤压
# 原 1500 KiB 分区的 15% 余量。
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# 语音包目录名加资源文件名最长超过 SPIFFS 默认 32 字节。
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# 原生 BLE Peripheral：只启用 NimBLE GATT Server，并将配对信息持久化到 NVS。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# 保留 NimBLE 警告和错误，避免周期性 GATT Notify 的 INFO 日志刷屏。
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=12

# 真机已证实软件多地址 Slave 和被动 GPIO 嗅探都会破坏稳定的 0x24 控制链路。
# 默认固件只启用 ESP32-S3 硬件 I2C Slave @0x24；实验代码保留但不进入产品路径。
# CONFIG_DESK_YOURDESK_HEIGHT_SNIFFER_EXPERIMENTAL is not set
# CONFIG_DESK_YOURDESK_SOFT_I2C_MULTI_ADDRESS is not set
# 双 RJ45 面板侧使用 GPIO6/7 开漏软件 Master；控制盒侧继续使用稳定硬件
# I2C Slave @0x24，禁止恢复旧的软件多地址路径。
CONFIG_DESK_YOURDESK_PANEL_PROXY=y
CONFIG_DESK_MAX_HEIGHT_MM=940
CONFIG_DESK_BLE_HOLD_LEASE_MS=750

# 双 ToF 提供实时显示和上升安全输入：I2C1 GPIO10/11，独立 SHUT GPIO12/13。
CONFIG_DESK_TOF_ENABLE=y
CONFIG_DESK_TOF_I2C_PORT=1
CONFIG_DESK_TOF_I2C_SCL_GPIO=10
CONFIG_DESK_TOF_I2C_SDA_GPIO=11
CONFIG_DESK_TOF_RIGHT_SHUT_GPIO=12
CONFIG_DESK_TOF_HEIGHT_SHUT_GPIO=13
CONFIG_DESK_TOF_RIGHT_OFFSET_MM=0
CONFIG_DESK_OLED_ENABLE=y

# MAX98357A：ESP32-S3 I2S TX，不需要 MCLK。GPIO14/15/16 保留给音频链路。
CONFIG_DESK_AUDIO_ENABLED=y
CONFIG_DESK_AUDIO_I2S_BCLK_GPIO=14
CONFIG_DESK_AUDIO_I2S_WS_GPIO=15
CONFIG_DESK_AUDIO_I2S_DOUT_GPIO=16
CONFIG_DESK_AUDIO_DEFAULT_VOLUME_PERCENT=60
CONFIG_DESK_REMINDER_ENABLED=y

# ToF 读数同时用于显示、档位闭环和上升安全限制，禁止回退到模拟值。
# CONFIG_DESK_SIM_HEIGHT is not set
